---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.CurveIsDetail
source: html/920b976d-623f-f53e-a321-a6c7090e2195.htm
---
# Autodesk.Revit.DB.ParameterTypeId.CurveIsDetail Property

"Detail Line"

## Syntax (C#)
```csharp
public static ForgeTypeId CurveIsDetail { get; }
```